### Terraform `plan` Succeeded for Workspace: `dev`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster_auth.this will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "this" {
+       id    = (known after apply)
+       name  = (known after apply)
+       token = (sensitive value)
    }

  # module.eks_blueprints.data.aws_eks_cluster.cluster[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "cluster" {
+       arn                       = (known after apply)
+       certificate_authority     = (known after apply)
+       cluster_id                = (known after apply)
+       created_at                = (known after apply)
+       enabled_cluster_log_types = (known after apply)
+       endpoint                  = (known after apply)
+       id                        = (known after apply)
+       identity                  = (known after apply)
+       kubernetes_network_config = (known after apply)
+       name                      = (known after apply)
+       outpost_config            = (known after apply)
+       platform_version          = (known after apply)
+       role_arn                  = (known after apply)
+       status                    = (known after apply)
+       tags                      = (known after apply)
+       version                   = (known after apply)
+       vpc_config                = (known after apply)
    }

  # module.eks_blueprints.data.http.eks_cluster_readiness[0] will be read during apply
  # (config refers to values not yet known)
 <= data "http" "eks_cluster_readiness" {
+       body             = (known after apply)
+       ca_certificate   = (known after apply)
+       id               = (known after apply)
+       response_headers = (known after apply)
+       timeout          = 600
+       url              = (known after apply)
    }

  # module.eks_blueprints.kubernetes_config_map.aws_auth[0] will be created
+   resource "kubernetes_config_map" "aws_auth" {
+       data = (known after apply)
+       id   = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/created-by" = "terraform-aws-eks-blueprints"
+               "app.kubernetes.io/managed-by" = "terraform-aws-eks-blueprints"
            }
+           name             = "aws-auth"
+           namespace        = "kube-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.kubernetes_addons.data.aws_eks_cluster.eks_cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "eks_cluster" {
+       arn                       = (known after apply)
+       certificate_authority     = (known after apply)
+       cluster_id                = (known after apply)
+       created_at                = (known after apply)
+       enabled_cluster_log_types = (known after apply)
+       endpoint                  = (known after apply)
+       id                        = (known after apply)
+       identity                  = (known after apply)
+       kubernetes_network_config = (known after apply)
+       name                      = (known after apply)
+       outpost_config            = (known after apply)
+       platform_version          = (known after apply)
+       role_arn                  = (known after apply)
+       status                    = (known after apply)
+       tags                      = (known after apply)
+       version                   = (known after apply)
+       vpc_config                = (known after apply)
    }

  # module.kubernetes_addons.time_sleep.dataplane will be created
+   resource "time_sleep" "dataplane" {
+       create_duration = "10s"
+       id              = (known after apply)
+       triggers        = {
+           "data_plane_wait_arn" = ""
        }
    }

  # module.eks_blueprints.module.aws_eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
+       certificates = (known after apply)
+       id           = (known after apply)
+       url          = (known after apply)
    }

  # module.eks_blueprints.module.aws_eks.aws_ec2_tag.cluster_primary_security_group["environment"] will be created
+   resource "aws_ec2_tag" "cluster_primary_security_group" {
+       id          = (known after apply)
+       key         = "environment"
+       resource_id = (known after apply)
+       value       = "dev"
    }

  # module.eks_blueprints.module.aws_eks.aws_ec2_tag.cluster_primary_security_group["owners"] will be created
+   resource "aws_ec2_tag" "cluster_primary_security_group" {
+       id          = (known after apply)
+       key         = "owners"
+       resource_id = (known after apply)
+       value       = "jingood2"
    }

  # module.eks_blueprints.module.aws_eks.aws_eks_cluster.this[0] will be created
+   resource "aws_eks_cluster" "this" {
+       arn                       = (known after apply)
+       certificate_authority     = (known after apply)
+       cluster_id                = (known after apply)
+       created_at                = (known after apply)
+       enabled_cluster_log_types = [
+           "api",
+           "audit",
+           "authenticator",
+           "controllerManager",
+           "scheduler",
        ]
+       endpoint                  = (known after apply)
+       id                        = (known after apply)
+       identity                  = (known after apply)
+       name                      = "jingood2-dev-eks"
+       platform_version          = (known after apply)
+       role_arn                  = (known after apply)
+       status                    = (known after apply)
+       tags                      = {
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       tags_all                  = {
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       version                   = "1.25"

+       encryption_config {
+           resources = [
+               "secrets",
            ]

+           provider {
+               key_arn = (known after apply)
            }
        }

+       kubernetes_network_config {
+           ip_family         = "ipv4"
+           service_ipv4_cidr = (known after apply)
+           service_ipv6_cidr = (known after apply)
        }

+       timeouts {}

+       vpc_config {
+           cluster_security_group_id = (known after apply)
+           endpoint_private_access   = false
+           endpoint_public_access    = true
+           public_access_cidrs       = [
+               "0.0.0.0/0",
            ]
+           security_group_ids        = (known after apply)
+           subnet_ids                = [
+               "subnet-0295d3a037cfc7c23",
+               "subnet-0d102e9e62c553f9a",
            ]
+           vpc_id                    = (known after apply)
        }
    }

  # module.eks_blueprints.module.aws_eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
+   resource "aws_iam_openid_connect_provider" "oidc_provider" {
+       arn             = (known after apply)
+       client_id_list  = [
+           "sts.amazonaws.com",
        ]
+       id              = (known after apply)
+       tags            = {
+           "Name"        = "jingood2-dev-eks-eks-irsa"
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       tags_all        = {
+           "Name"        = "jingood2-dev-eks-eks-irsa"
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       thumbprint_list = (known after apply)
+       url             = (known after apply)
    }

  # module.eks_blueprints.module.aws_eks.aws_iam_role.this[0] will be created
+   resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "eks.amazonaws.com"
                        }
+                       Sid       = "EKSClusterAssumeRole"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "jingood2-dev-eks-cluster-role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags                  = {
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       tags_all              = {
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       unique_id             = (known after apply)
    }

  # module.eks_blueprints.module.aws_eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
+       role       = "jingood2-dev-eks-cluster-role"
    }

  # module.eks_blueprints.module.aws_eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
+       role       = "jingood2-dev-eks-cluster-role"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group.cluster[0] will be created
+   resource "aws_security_group" "cluster" {
+       arn                    = (known after apply)
+       description            = "EKS cluster security group"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = "jingood2-dev-eks-cluster-"
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name"        = "jingood2-dev-eks-cluster"
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       tags_all               = {
+           "Name"        = "jingood2-dev-eks-cluster"
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       vpc_id                 = "vpc-001360522b20e3855"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group.node[0] will be created
+   resource "aws_security_group" "node" {
+       arn                    = (known after apply)
+       description            = "EKS node shared security group"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = "jingood2-dev-eks-node-"
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name"                                   = "jingood2-dev-eks-node"
+           "environment"                            = "dev"
+           "kubernetes.io/cluster/jingood2-dev-eks" = "owned"
+           "owners"                                 = "jingood2"
        }
+       tags_all               = {
+           "Name"                                   = "jingood2-dev-eks-node"
+           "environment"                            = "dev"
+           "kubernetes.io/cluster/jingood2-dev-eks" = "owned"
+           "owners"                                 = "jingood2"
        }
+       vpc_id                 = "vpc-001360522b20e3855"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group_rule.cluster["egress_nodes_443"] will be created
+   resource "aws_security_group_rule" "cluster" {
+       description              = "Cluster API to node groups"
+       from_port                = 443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 443
+       type                     = "egress"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group_rule.cluster["egress_nodes_kubelet"] will be created
+   resource "aws_security_group_rule" "cluster" {
+       description              = "Cluster API to node kubelets"
+       from_port                = 10250
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 10250
+       type                     = "egress"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
+   resource "aws_security_group_rule" "cluster" {
+       description              = "Node groups to cluster API"
+       from_port                = 443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 443
+       type                     = "ingress"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_cluster_443"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Node groups to cluster API"
+       from_port                = 443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 443
+       type                     = "egress"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_https"] will be created
+   resource "aws_security_group_rule" "node" {
+       cidr_blocks              = [
+           "0.0.0.0/0",
        ]
+       description              = "Egress all HTTPS to internet"
+       from_port                = 443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 443
+       type                     = "egress"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_ntp_tcp"] will be created
+   resource "aws_security_group_rule" "node" {
+       cidr_blocks              = [
+           "0.0.0.0/0",
        ]
+       description              = "Egress NTP/TCP to internet"
+       from_port                = 123
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 123
+       type                     = "egress"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_ntp_udp"] will be created
+   resource "aws_security_group_rule" "node" {
+       cidr_blocks              = [
+           "0.0.0.0/0",
        ]
+       description              = "Egress NTP/UDP to internet"
+       from_port                = 123
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "udp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 123
+       type                     = "egress"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_self_coredns_tcp"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Node to node CoreDNS"
+       from_port                = 53
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = true
+       source_security_group_id = (known after apply)
+       to_port                  = 53
+       type                     = "egress"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["egress_self_coredns_udp"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Node to node CoreDNS"
+       from_port                = 53
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "udp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = true
+       source_security_group_id = (known after apply)
+       to_port                  = 53
+       type                     = "egress"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["ingress_cluster_443"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node groups"
+       from_port                = 443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 443
+       type                     = "ingress"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["ingress_cluster_kubelet"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node kubelets"
+       from_port                = 10250
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 10250
+       type                     = "ingress"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Node to node CoreDNS"
+       from_port                = 53
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = true
+       source_security_group_id = (known after apply)
+       to_port                  = 53
+       type                     = "ingress"
    }

  # module.eks_blueprints.module.aws_eks.aws_security_group_rule.node["ingress_self_coredns_udp"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Node to node CoreDNS"
+       from_port                = 53
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "udp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = true
+       source_security_group_id = (known after apply)
+       to_port                  = 53
+       type                     = "ingress"
    }

  # module.eks_blueprints.module.aws_eks_managed_node_groups["role"].data.aws_iam_policy_document.managed_ng_assume_role_policy will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "managed_ng_assume_role_policy" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions = [
+               "sts:AssumeRole",
            ]
+           sid     = "EKSWorkerAssumeRole"

+           principals {
+               identifiers = [
+                   "ec2.amazonaws.com",
                ]
+               type        = "Service"
            }
        }
    }

  # module.eks_blueprints.module.aws_eks_managed_node_groups["role"].aws_eks_node_group.managed_ng will be created
+   resource "aws_eks_node_group" "managed_ng" {
+       ami_type               = "AL2_x86_64"
+       arn                    = (known after apply)
+       capacity_type          = "SPOT"
+       cluster_name           = (known after apply)
+       disk_size              = 50
+       id                     = (known after apply)
+       instance_types         = [
+           "t3a.medium",
        ]
+       node_group_name        = (known after apply)
+       node_group_name_prefix = "general-"
+       node_role_arn          = (known after apply)
+       release_version        = (known after apply)
+       resources              = (known after apply)
+       status                 = (known after apply)
+       subnet_ids             = [
+           "subnet-0295d3a037cfc7c23",
+           "subnet-0d102e9e62c553f9a",
        ]
+       tags                   = (known after apply)
+       tags_all               = (known after apply)
+       version                = "1.25"

+       scaling_config {
+           desired_size = 1
+           max_size     = 2
+           min_size     = 1
        }

+       timeouts {
+           create = "30m"
+           delete = "30m"
+           update = "2h"
        }

+       update_config {
+           max_unavailable = 1
        }
    }

  # module.eks_blueprints.module.aws_eks_managed_node_groups["role"].aws_iam_instance_profile.managed_ng[0] will be created
+   resource "aws_iam_instance_profile" "managed_ng" {
+       arn         = (known after apply)
+       create_date = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
+       name_prefix = (known after apply)
+       path        = "/"
+       role        = (known after apply)
+       tags        = {
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       tags_all    = {
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       unique_id   = (known after apply)
    }

  # module.eks_blueprints.module.aws_eks_managed_node_groups["role"].aws_iam_role.managed_ng[0] will be created
+   resource "aws_iam_role" "managed_ng" {
+       arn                   = (known after apply)
+       assume_role_policy    = (known after apply)
+       create_date           = (known after apply)
+       description           = "EKS Managed Node group IAM Role"
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags                  = {
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       tags_all              = {
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       unique_id             = (known after apply)
    }

  # module.eks_blueprints.module.aws_eks_managed_node_groups["role"].aws_iam_role_policy_attachment.managed_ng["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be created
+   resource "aws_iam_role_policy_attachment" "managed_ng" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
+       role       = (known after apply)
    }

  # module.eks_blueprints.module.aws_eks_managed_node_groups["role"].aws_iam_role_policy_attachment.managed_ng["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be created
+   resource "aws_iam_role_policy_attachment" "managed_ng" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
+       role       = (known after apply)
    }

  # module.eks_blueprints.module.aws_eks_managed_node_groups["role"].aws_iam_role_policy_attachment.managed_ng["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be created
+   resource "aws_iam_role_policy_attachment" "managed_ng" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
+       role       = (known after apply)
    }

  # module.eks_blueprints.module.aws_eks_managed_node_groups["role"].aws_iam_role_policy_attachment.managed_ng["arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"] will be created
+   resource "aws_iam_role_policy_attachment" "managed_ng" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
+       role       = (known after apply)
    }

  # module.eks_blueprints.module.aws_eks_teams[0].data.aws_eks_cluster.eks_cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "eks_cluster" {
+       arn                       = (known after apply)
+       certificate_authority     = (known after apply)
+       cluster_id                = (known after apply)
+       created_at                = (known after apply)
+       enabled_cluster_log_types = (known after apply)
+       endpoint                  = (known after apply)
+       id                        = (known after apply)
+       identity                  = (known after apply)
+       kubernetes_network_config = (known after apply)
+       name                      = (known after apply)
+       outpost_config            = (known after apply)
+       platform_version          = (known after apply)
+       role_arn                  = (known after apply)
+       status                    = (known after apply)
+       tags                      = (known after apply)
+       version                   = (known after apply)
+       vpc_config                = (known after apply)
    }

  # module.eks_blueprints.module.aws_eks_teams[0].data.aws_iam_policy_document.platform_team_eks_access[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "platform_team_eks_access" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "eks:AccessKubernetesApi",
+               "eks:DescribeCluster",
+               "eks:DescribeNodegroup",
+               "eks:ListClusters",
+               "eks:ListFargateProfiles",
+               "eks:ListNodegroups",
+               "eks:ListUpdates",
+               "ssm:GetParameter",
            ]
+           resources = [
+               (known after apply),
            ]
+           sid       = "AllowPlatformTeamEKSAccess"
        }
+       statement {
+           actions   = [
+               "eks:ListClusters",
            ]
+           resources = [
+               "*",
            ]
+           sid       = "AllowListClusters"
        }
    }

  # module.eks_blueprints.module.aws_eks_teams[0].aws_iam_policy.platform_team_eks_access[0] will be created
+   resource "aws_iam_policy" "platform_team_eks_access" {
+       arn         = (known after apply)
+       description = "Platform Team EKS Console Access"
+       id          = (known after apply)
+       name        = (known after apply)
+       name_prefix = (known after apply)
+       path        = "/"
+       policy      = (known after apply)
+       policy_id   = (known after apply)
+       tags        = {
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       tags_all    = {
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
    }

  # module.eks_blueprints.module.aws_eks_teams[0].aws_iam_role.platform_team["admin"] will be created
+   resource "aws_iam_role" "platform_team" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = [
+                               "arn:aws:iam::484752921218:user/jingood2@sk.com",
                            ]
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags                  = {
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       tags_all              = {
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       unique_id             = (known after apply)
    }

  # module.eks_blueprints.module.kms[0].aws_kms_alias.this will be created
+   resource "aws_kms_alias" "this" {
+       arn            = (known after apply)
+       id             = (known after apply)
+       name           = "alias/jingood2-dev-eks"
+       name_prefix    = (known after apply)
+       target_key_arn = (known after apply)
+       target_key_id  = (known after apply)
    }

  # module.eks_blueprints.module.kms[0].aws_kms_key.this will be created
+   resource "aws_kms_key" "this" {
+       arn                                = (known after apply)
+       bypass_policy_lockout_safety_check = false
+       customer_master_key_spec           = "SYMMETRIC_DEFAULT"
+       deletion_window_in_days            = 30
+       description                        = "jingood2-dev-eks EKS cluster secret encryption key"
+       enable_key_rotation                = true
+       id                                 = (known after apply)
+       is_enabled                         = true
+       key_id                             = (known after apply)
+       key_usage                          = "ENCRYPT_DECRYPT"
+       multi_region                       = (known after apply)
+       policy                             = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = [
+                           "kms:ReEncrypt*",
+                           "kms:GenerateDataKey*",
+                           "kms:Encrypt",
+                           "kms:DescribeKey",
+                           "kms:Decrypt",
+                           "kms:CreateGrant",
                        ]
+                       Condition = {
+                           StringEquals = {
+                               "kms:CallerAccount" = "484752921218"
+                               "kms:ViaService"    = "eks.us-east-1.amazonaws.com"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = "arn:aws:iam::484752921218:root"
                        }
+                       Resource  = "*"
+                       Sid       = "Allow access for all principals in the account that are authorized"
                    },
+                   {
+                       Action    = [
+                           "kms:RevokeGrant",
+                           "kms:List*",
+                           "kms:Get*",
+                           "kms:Describe*",
                        ]
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = "arn:aws:iam::484752921218:root"
                        }
+                       Resource  = "*"
+                       Sid       = "Allow direct access to key metadata to the account"
                    },
+                   {
+                       Action    = "kms:*"
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = "arn:aws:iam::484752921218:user/jingood2@sk.com"
                        }
+                       Resource  = "*"
+                       Sid       = "Allow access for Key Administrators"
                    },
+                   {
+                       Action    = [
+                           "kms:ReEncrypt*",
+                           "kms:GenerateDataKey*",
+                           "kms:Encrypt",
+                           "kms:DescribeKey",
+                           "kms:Decrypt",
                        ]
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = "arn:aws:iam::484752921218:role/jingood2-dev-eks-cluster-role"
                        }
+                       Resource  = "*"
+                       Sid       = "Allow use of the key"
                    },
+                   {
+                       Action    = [
+                           "kms:RevokeGrant",
+                           "kms:ListGrants",
+                           "kms:CreateGrant",
                        ]
+                       Condition = {
+                           Bool = {
+                               "kms:GrantIsForAWSResource" = "true"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           AWS = "arn:aws:iam::484752921218:role/jingood2-dev-eks-cluster-role"
                        }
+                       Resource  = "*"
+                       Sid       = "Allow attachment of persistent resources"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       tags                               = {
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
+       tags_all                           = {
+           "environment" = "dev"
+           "owners"      = "jingood2"
        }
    }

  # module.kubernetes_addons.module.argocd[0].helm_release.argocd_application["addons"] will be created
+   resource "helm_release" "argocd_application" {
+       atomic                     = false
+       chart                      = ".terraform/modules/kubernetes_addons/modules/kubernetes-addons/argocd/argocd-application/helm"
+       cleanup_on_fail            = false
+       create_namespace           = false
+       dependency_update          = false
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "addons"
+       namespace                  = "argocd"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 300
+       values                     = [
+           <<-EOT
                "ignoreDifferences": []
            EOT,
        ]
+       verify                     = false
+       version                    = "0.1.0"
+       wait                       = true
+       wait_for_jobs              = false

+       set {
+           name  = "destination.server"
+           type  = "string"
+           value = "https://kubernetes.default.svc"
        }
+       set {
+           name  = "name"
+           type  = "string"
+           value = "addons"
        }
+       set {
+           name  = "project"
+           type  = "string"
+           value = "default"
        }
+       set {
+           name  = "source.helm.releaseName"
+           type  = "string"
+           value = "addons"
        }
+       set {
+           name  = "source.helm.values"
+           type  = "auto"
+           value = (known after apply)
        }
+       set {
+           name  = "source.path"
+           type  = "string"
+           value = "chart"
        }
+       set {
+           name  = "source.repoUrl"
+           type  = "string"
+           value = "https://github.com/aws-samples/eks-blueprints-add-ons.git"
        }
+       set {
+           name  = "source.targetRevision"
+           type  = "string"
+           value = "HEAD"
        }
    }

  # module.kubernetes_addons.module.argocd[0].kubernetes_namespace_v1.this[0] will be created
+   resource "kubernetes_namespace_v1" "this" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.kubernetes_addons.module.aws_ebs_csi_driver[0].aws_eks_addon.aws_ebs_csi_driver[0] will be created
+   resource "aws_eks_addon" "aws_ebs_csi_driver" {
+       addon_name               = "aws-ebs-csi-driver"
+       addon_version            = "v1.17.0-eksbuild.1"
+       arn                      = (known after apply)
+       cluster_name             = (known after apply)
+       configuration_values     = (known after apply)
+       created_at               = (known after apply)
+       id                       = (known after apply)
+       modified_at              = (known after apply)
+       preserve                 = true
+       resolve_conflicts        = "OVERWRITE"
+       service_account_role_arn = (known after apply)
+       tags_all                 = (known after apply)
    }

  # module.kubernetes_addons.module.aws_ebs_csi_driver[0].aws_iam_policy.aws_ebs_csi_driver[0] will be created
+   resource "aws_iam_policy" "aws_ebs_csi_driver" {
+       arn         = (known after apply)
+       description = "IAM Policy for AWS EBS CSI Driver"
+       id          = (known after apply)
+       name        = (known after apply)
+       name_prefix = (known after apply)
+       path        = "/"
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "ec2:ModifyVolume",
+                           "ec2:DetachVolume",
+                           "ec2:DescribeVolumesModifications",
+                           "ec2:DescribeVolumes",
+                           "ec2:DescribeTags",
+                           "ec2:DescribeSnapshots",
+                           "ec2:DescribeInstances",
+                           "ec2:DescribeAvailabilityZones",
+                           "ec2:CreateSnapshot",
+                           "ec2:AttachVolume",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = ""
                    },
+                   {
+                       Action    = "ec2:CreateTags"
+                       Condition = {
+                           StringEquals = {
+                               "ec2:CreateAction" = [
+                                   "CreateVolume",
+                                   "CreateSnapshot",
                                ]
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = [
+                           "arn:aws:ec2:*:*:volume/*",
+                           "arn:aws:ec2:*:*:snapshot/*",
                        ]
+                       Sid       = ""
                    },
+                   {
+                       Action   = "ec2:DeleteTags"
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:ec2:*:*:volume/*",
+                           "arn:aws:ec2:*:*:snapshot/*",
                        ]
+                       Sid      = ""
                    },
+                   {
+                       Action    = "ec2:CreateVolume"
+                       Condition = {
+                           StringLike = {
+                               "aws:RequestTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = "ec2:CreateVolume"
+                       Condition = {
+                           StringLike = {
+                               "aws:RequestTag/CSIVolumeName" = "*"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = "ec2:CreateVolume"
+                       Condition = {
+                           StringLike = {
+                               "aws:RequestTag/kubernetes.io/cluster/*" = "owned"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = "ec2:DeleteVolume"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = "ec2:DeleteVolume"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/CSIVolumeName" = "*"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = "ec2:DeleteVolume"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/kubernetes.io/cluster/*" = "owned"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = "ec2:DeleteSnapshot"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/CSIVolumeSnapshotName" = "*"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = "ec2:DeleteSnapshot"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id   = (known after apply)
+       tags_all    = (known after apply)
    }

  # module.kubernetes_addons.module.argocd[0].module.helm_addon.helm_release.addon[0] will be created
+   resource "helm_release" "addon" {
+       atomic                     = false
+       chart                      = "argo-cd"
+       cleanup_on_fail            = false
+       create_namespace           = true
+       dependency_update          = false
+       description                = "The ArgoCD Helm Chart deployment configuration"
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "argo-cd"
+       namespace                  = "argocd"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://argoproj.github.io/argo-helm"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 1200
+       values                     = [
+           <<-EOT
                redis-ha:
                  enabled: true
                
                controller:
                  enableStatefulSet: true
                
                server:
                  autoscaling:
                    enabled: true
                    minReplicas: 2
                
                repoServer:
                  autoscaling:
                    enabled: true
                    minReplicas: 2
                
                configs:
                  cm:
                    #use annotation for tracking but keep labels for compatibility with other tools
                    application.resourceTrackingMethod: annotation+label
            EOT,
        ]
+       verify                     = false
+       version                    = "5.13.8"
+       wait                       = false
+       wait_for_jobs              = false

+       postrender {}

+       set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.kubernetes_addons.module.aws_ebs_csi_driver[0].module.irsa_addon[0].aws_iam_role.irsa[0] will be created
+   resource "aws_iam_role" "irsa" {
+       arn                   = (known after apply)
+       assume_role_policy    = (known after apply)
+       create_date           = (known after apply)
+       description           = "AWS IAM Role for the Kubernetes service account ebs-csi-controller-sa."
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)
    }

  # module.kubernetes_addons.module.aws_ebs_csi_driver[0].module.irsa_addon[0].aws_iam_role_policy_attachment.irsa[0] will be created
+   resource "aws_iam_role_policy_attachment" "irsa" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = (known after apply)
    }

Plan: 42 to add, 0 to change, 0 to destroy.
```
</details>